title: Mesh Agent Execution
id: 753d9010-fed7-425e-9d3a-0a5510024840
status: experimental
description: Detects Mesh Agent, the client software used to connect to a Mesh Central Server
References:
   - https://github.com/Ylianst/MeshCentral/blob/08430a5fa7b0227e8c84951cd06226e86f39943a/certoperations.jsnslookup
author: Craig Sweeney
date: 2025-05-27
tags:
    - attack.command_and_control
    - attack.T1219
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Company|contains: ’Meshcentralroot’
    condition: selection
falsepositives:
    - Legitimate usage by System Administrators
level: low
