logsource:
  category: process_creation
  product: windows
detection:
  condition: 1 of selection*
  selection0:
    Image|endswith: '\powershell.exe'
    CommandLine|contains|all:
      - "net.sockets.tcpclient"
      - "io.streamwriter"
  selection1:
    Image|endswith: '\powershell.exe'
    CommandLine|contains|all:
      - "net.sockets.tcpclient"
      - "getstream"
