title: Scripting Interpreter Execution Using CMSTPLUA COM Interface
id: d4e9ed08-5356-4cb4-884f-a024d6ac3704
status: experimental
description: Detects the use of a CMSTPLUA elevated COM Interface to execute a scripting interpreter to launch scripts or commands. Using this COM Interface bypasses UAC, and
  has been used by numerous threat actors to execute ransomware and other malware.
author: Matt Anderson (Huntress)
references:
- https://www.securityinbits.com/malware-analysis/uac-bypass-analysis-stage-1-ataware-ransomware-part-2/
- https://gist.github.com/hfiref0x/196af729106b780db1c73428b5a5d68d
- https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-075a
- https://www.varonis.com/blog/blackcat-ransomware
- https://www.elastic.co/security-labs/exploring-windows-uac-bypasses-techniques-and-detection-strategies
- http://www.huntress.com/blog/its-not-safe-to-pay-safepay
date: 2024-11-01
tags:
  - attack.defense-evasion
  - attack.privilege-escalation
  - attack.execution
  - attack.t1548.002
  - attack.t1218
  - attack.t1559.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith: '\dllhost.exe'
    ParentCommandLine|contains: 'Processid:{3E5FC7F9-9A51-4367-9063-A120244FBEC7}'
  selection_interpreter:
    - Image|endswith:
        - '\cmd.exe'
        - '\powershell.exe'
        - '\wscript.exe'
        - '\pwsh.exe'
        - '\powershell_ise.exe'
    - OriginalFileName:
        - 'Cmd.Exe'
        - 'PowerShell.EXE'
        - 'pwsh.dll'
        - 'wscript.exe'
        - 'powershell_ise.EXE'
  condition: all of selection_*
falsepositives:
- Some legitimate applications may use this occasionally
level: high

